brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "libpq"            # PATH is set for libpq binaries
brew "nvm"
brew "gh"
brew "deno"
brew "uv"
brew "gemini-cli"

# Fast CLI utilities (added 2026-01-04)
brew "fd"              # faster find
brew "bat"             # better cat with syntax highlighting
brew "eza"             # modern ls
brew "fzf"             # fuzzy finder
brew "jq"              # JSON processor
brew "git-delta"       # better git diff
brew "btop"            # system monitor

cask "docker"
cask "emacs"
cask "zed"
#cask "claude-code" #although native install is recommended, curl -fsSL https://claude.ai/install.sh | bash
cask "ghostty"
cask "tailscale"
cask "ngrok"
cask "codex"
